/*
 * @Author: zxy
 * @Date: 2024-09-20 16:52:44
 * @LastEditTime: 2024-09-29 17:45:15
 * @FilePath: \MakeMemo\src\assets\data\status.js
 */
// Desc: 状态数据
import { STORE_NAME_LIFE, STORE_NAME_WORK } from "../../mockApiForIndexDB/task";
import { createEnum } from "../../utils/index";

// ==================================================
// SkuHeader组件使用
// ==================================================
// 头部标题
export const HeaderTitle = "SkuTodo";
// ==================================================
// SkuHeader组件使用 end
// ==================================================

// ==================================================
// SkuText组件使用
// ==================================================
// 支持的Tpye类型
export const TextType = createEnum({
  // 文本
  text: "文本",
  // 标题1号
  h1: "标题1号",
  // 标题2号
  h2: "标题2号",
  // 标题3号
  h3: "标题3号",
  // 标题4号
  h4: "标题4号",
  // 标题5号
  h5: "标题5号",
  // 标题6号
  h6: "标题6号",
});

// 支持的特殊字体
export const TextFont = createEnum({
  // 默认
  chineseFont: "默认",
  // header标题字体
  headerTitleFont: "header标题字体",
  // 数字字体
  numberFont: "数字字体",
});
// ==================================================
// SkuText组件使用 end
// ==================================================

// ==================================================
// SkuTask, SkuAddTask组件使用
// ==================================================
// 任务状态
export const TaskStatus = createEnum({
  // 未完成
  "00": "未完成",
  // 已完成
  "01": "已完成",
  // 已删除
  "02": "已删除",
});

// 关闭滑动单元格的类型（vant）
export const CloseCellType = createEnum({
  // 左侧区域（编辑）
  编辑: "left",
  // 右侧区域（删除）
  删除: "right",
  // 主体部分
  主体: "cell",
  // 外部
  外部: "outside",
});

// 任务优先级 数字越小优先级越高， 无优先级默认最低
export const TaskPriority = createEnum({
  "00": "优先级1",
  "01": "优先级2",
  "02": "优先级3",
  "03": "优先级4",
  "04": "优先级5",
  "05": "优先级6",
  "06": "无优先级",
});
// ==================================================
// SkuTask组件使用 end
// ==================================================

// ==================================================
// HomePage,侧边栏使用
// ==================================================
export const Sidebar = createEnum({
  // 生活
  生活: 0,
  // 工作
  工作: 1,
});
// ==================================================
// HomePage,侧边栏使用 end
// ==================================================

// ==================================================
// HomePage,底部菜单使用
// ==================================================
export const Footer = createEnum({
  // 未完成
  未完成: 0,
  // 已完成
  已完成: 1,
});
// ==================================================
// HomePage,底部菜单使用 end
// ==================================================

// ==================================================
// API请求分类使用
// ==================================================
export const ApiType = createEnum({
  // 生活
  [STORE_NAME_LIFE]: Sidebar["生活"],
  // 工作
  [STORE_NAME_WORK]: Sidebar["工作"],
});
// ==================================================
// API请求分类使用 end
// ==================================================

// ==================================================
// HomePage使用
// ==================================================
export const sortType = createEnum({
  // 优先级升序
  优先级升序: 0,
  // 优先级降序
  优先级降序: 1,
  // 时间升序
  时间升序: 2,
  // 时间降序
  时间降序: 3,
});
// ==================================================
// HomePage使用 end
// ==================================================
